Hi @bweston92,

I copied your config and was able to reproduce the behavior.  When a plan suggests recreating a resource, look for where it calls out which change `forces replacement`. In your case, I see:

```
  # digitalocean_database_cluster.mongodb must be replaced
-/+ resource "digitalocean_database_cluster" "mongodb" {
      ~ database             = "admin" -> (known after apply)
      ~ host                 = "dev-mongodb-cluster-7f63b382.mongo.ondigitalocean.com" -> (known after apply)
      ~ id                   = "0c7463dc-20d8-4500-8141-17cf12eefdd6" -> (known after apply)
        name                 = "dev-mongodb-cluster"
      ~ password             = (sensitive value)
      ~ port                 = 27017 -> (known after apply)
      ~ private_host         = "private-dev-mongodb-cluster-ba96f39b.mongo.ondigitalocean.com" -> (known after apply)
      ~ private_network_uuid = "beca7afa-dc82-11e8-83ec-3cfdfea9f3f0" -> (known after apply)
      ~ private_uri          = (sensitive value)
      - tags                 = [] -> null
      ~ uri                  = (sensitive value)
      ~ urn                  = "do:dbaas:0c7463dc-20d8-4500-8141-17cf12eefdd6" -> (known after apply)
      ~ user                 = "doadmin" -> (known after apply)
      ~ version              = "4" -> "4.4" # forces replacement
        # (4 unchanged attributes hidden)
    }
```

Specifically: ` ~ version              = "4" -> "4.4" # forces replacement`

If you update the `version` for the MongoDB cluster in your config from `4.4` to just `4`, everything should work as expected.